doc/presentations/opal_irb_overview.org
#+Title: Overview of Opal-IRB features
#+Author: Forrest Chang
#+Email: fkchang2000@yahoo.com
#+REVEAL_ROOT: http://cdn.jsdelivr.net/reveal.js/3.0.0/
#+OPTIONS: num:nil toc:nil
* Reason for the talk
#+ATTR_REVEAL: :frag (roll-in roll-in roll-in roll-in roll-in roll-in)
#+ATTR_HTML: :target "_blank"
- [[https://github.com/fkchang/opal-irb/blob/master/README.md][opal-irb]] has many features
- Most don't know about them
- Hence this talk (based on http://funkworks.blogspot.com/2015/08/an-overview-of-opal-irbs-features.html)


* What is opal-irb?
#+ATTR_REVEAL: :frag (roll-in roll-in roll-in roll-in roll-in roll-in)
- https://github.com/fkchang/opal-irb
- An in browser REPL (read eval print loop)
- Aims to be the opal equivalent of Ruby's irb (interactive ruby), and pry
- A tool in which you can play with Ruby any time you have access to a browser


* 3 Sections
#+ATTR_REVEAL: :frag (roll-in roll-in roll-in roll-in roll-in roll-in)
1. What opal-irb has in common with irb
2. How opal-irb differs from irb
3. Features unique to opal-irb

* 1) In Common with irb

** Terminal Emulation (of sorts)
#+ATTR_REVEAL: :frag (roll-in roll-in roll-in roll-in roll-in roll-in)
- irb - terminal formatting
- opal-irb, via a jqconsole fork, supports some ANSI formatting code

#+ATTR_REVEAL: :frag (roll-in roll-in roll-in roll-in roll-in roll-in)
Example
#+ATTR_REVEAL: :frag (roll-in roll-in roll-in roll-in roll-in roll-in)
#+BEGIN_SRC ruby
puts "\033[31mRed Text"
#+END_SRC

*** ANSI colors In browser
#+BEGIN_HTML
<iframe width="100%" height="500" src="http://git.io/vmQVY" frameborder="0" allowfullscreen></iframe>
#+END_HTML

** History up down history
#+ATTR_REVEAL: :frag (roll-in roll-in roll-in roll-in roll-in roll-in)
- Like irb, opal-irb stores a history of previous statements.
- Navigate this history with the up/down arrows
- or use the "GNU readline commands".

*** GNU readline commands (emacs subset)
#+ATTR_REVEAL: :frag (roll-in roll-in roll-in roll-in roll-in roll-in)
- A subset of the gnu readline manipulation is supported.
- Will likely add more support over time.
- The currently supported bindings are:

#+ATTR_REVEAL: :frag (roll-in roll-in roll-in roll-in roll-in roll-in)
#+BEGIN_SRC
Up/Down Arrow and ctrl-p/ctrl-n: Navigate through history
ctrl-a:                          Beginning of line
ctrl-e:                          End of line
ctrl-b:                          Back 1 character
ctrl-f:                          Forward 1 character
ctrl-d:                          Delete 1 character
ctrl-k:                          Kill to the end of the line
alt-b:                           Back 1 word
alt-f:                           Forward 1 word
alt-d:                           Delete 1 word
#+END_SRC

** Autocomplete
#+ATTR_REVEAL: :frag (roll-in roll-in roll-in roll-in roll-in roll-in)
- A work-in-progress
- Same tab completion model that irb does.  It looks like this:

#+ATTR_REVEAL: :frag (roll-in roll-in roll-in roll-in roll-in roll-in)
#+BEGIN_SRC
opal> S<tab>
STDERR          STDIN           STDOUT          ScriptError     Set
SignalException StandardError   StopIteration   String          StringIO
StringScanner   Struct          Symbol          SyntaxError     SystemCallError
SystemExit
#+END_SRC

#+ATTR_REVEAL: :frag (roll-in roll-in roll-in roll-in roll-in roll-in)
#+BEGIN_SRC
opal> ST<tab>
STDERR STDIN  STDOUT
#+END_SRC

#+ATTR_REVEAL: :frag (roll-in roll-in roll-in roll-in roll-in roll-in)
#+BEGIN_SRC
opal> STDI<tab>
#+END_SRC

#+ATTR_REVEAL: :frag (roll-in roll-in roll-in roll-in roll-in roll-in)
#+BEGIN_SRC
opal> STDIN
#+END_SRC

** Live Autocomplete demo
#+BEGIN_HTML
<iframe width="100%" height="500" src="http://fkchang.github.io/opal-irb/index-jq.html" frameborder="0" allowfullscreen></iframe>
#+END_HTML


** Multi Line Input
#+ATTR_REVEAL: :frag (roll-in roll-in roll-in roll-in roll-in roll-in)
- You can type multiple lines until your entry is complete.
- Incomplete lines shown with leading periods:

#+ATTR_REVEAL: :frag (roll-in roll-in roll-in roll-in roll-in roll-in)
#+BEGIN_SRC
Welcome to Opal 0.7.1
type help for assistance
opal> class Foo
...   def bar
...     :bar
...     end
...     end
 => "bar"
opal>

#+END_SRC


* 2) Different than irb

** Last value returned - irb
In irb the last value returned is stored in _ variable:

#+BEGIN_SRC
2.2.1 :001 > 2 * 3
 => 6
2.2.1 :002 > puts _
6
 => nil
2.2.1 :003 >
#+END_SRC

** Opal-irb
#+ATTR_REVEAL: :frag (roll-in roll-in roll-in roll-in roll-in roll-in)
- Last value is stored as $_.
- Departs due to technical reasons
- Would like to make it the same

#+ATTR_REVEAL: :frag (roll-in roll-in roll-in roll-in roll-in roll-in)
#+BEGIN_SRC
opal> 2 * 3
 => 6
opal> puts $_
6
 => nil
opal>
#+END_SRC

** Help command

*** irb

Help in irb allows you to lookup documentation for methods via ri and rdoc docs.

#+BEGIN_SRC
2.0.0-p247 :001 > help

Enter the method name you want to look up.
You can use tab to autocomplete.
Enter a blank line to exit.

>>
#+END_SRC

*** Opal-irb
#+ATTR_REVEAL: :frag (roll-in roll-in roll-in roll-in roll-in roll-in)
- Opal-irb's help shows how to operate opal-irb.
- Help for method lookup to be done in a different fashion.

*** Current help command output
#+BEGIN_SRC
opal> help
help:                            This text
$_                               last value returned is stored in this global
history:                         Shows history
irb_link_for history_num:        Create a link for the code in the history
ctrl-c:                          Abort prompt
ctrl-m:                          Pop up multi-line editor
ctrl-Enter:                      Submit code in multi-line editor
ctrl-l:                          Creates a link with the code you have on the current line/lines

EDITOR FUNCTIONALITY
Up/Down Arrow and ctrl-p/ctrl-n: Navigate through history
ctrl-a:                          Beginning of line
ctrl-e:                          End of line
ctrl-b:                          Back 1 character
ctrl-f:                          Forward 1 character
ctrl-d:                          Delete 1 character
ctrl-k:                          Kill to the end of the line
alt-b:                           Back 1 word
alt-f:                           Forward 1 word
alt-d:                           Delete 1 word
 => nil

#+END_SRC

* 3) Beyond irb

There are number of things that opal-irb does that irb does not:


** "Live gist", create a link w/code
#+ATTR_REVEAL: :frag (roll-in roll-in roll-in roll-in roll-in roll-in)
- Create a link with  =ctl-l= (=l= for =link=),
- Link will be displayed above the line in question.
- Scroll through history, hit =ctl-l= to give history for that line

