doc/presentations/opal_irb_overview.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>Overview of Opal-IRB features</title>
<meta name="author" content="(Forrest Chang)"/>

<link rel="stylesheet" href="http://cdn.jsdelivr.net/reveal.js/3.0.0/css/reveal.css"/>
<link rel="stylesheet" href="http://cdn.jsdelivr.net/reveal.js/3.0.0/css/theme/moon.css" id="theme"/>

<!-- If the query includes 'print-pdf', include the PDF print sheet -->
</head>
<body>
<div class="reveal">
<div class="slides">
<section id="sec-title-slide">
<h1>Overview of Opal-IRB features</h1>
<h2>Forrest Chang</h2>
<h2><a href="mailto:fkchang2000@yahoo.com">fkchang2000@yahoo.com</a></h2>
<h2></h2>
</section>
<section>
<section id="slide-sec-1">
<h2 id="sec-1">Reason for the talk</h2>
<ul target="&quot;_blank&quot;">
<li class="fragment roll-in"><a href="https://github.com/fkchang/opal-irb/blob/master/README.md">opal-irb</a> has many features</li>
<li class="fragment roll-in">Most don't know about them</li>
<li class="fragment roll-in">Hence this talk</li>

</ul>

</section>
</section>
<section>
<section id="slide-sec-2">
<h2 id="sec-2">What is opal-irb?</h2>
<ul>
<li class="fragment roll-in"><a href="https://github.com/fkchang/opal-irb">https://github.com/fkchang/opal-irb</a></li>
<li class="fragment roll-in">An in browser REPL (read eval print loop)</li>
<li class="fragment roll-in">Aims to be the opal equivalent of Ruby's irb (interactive ruby), and pry</li>
<li class="fragment roll-in">A tool in which you can play with Ruby any time you have access to a browser</li>

</ul>


</section>
</section>
<section>
<section id="slide-sec-3">
<h2 id="sec-3">3 Sections</h2>
<ol>
<li class="fragment roll-in">What opal-irb has in common with irb</li>
<li class="fragment roll-in">How opal-irb differs from irb</li>
<li class="fragment roll-in">Features unique to opal-irb</li>

</ol>

</section>
</section>
<section>
<section id="slide-sec-4">
<h2 id="sec-4">1) In Common with irb</h2>
<div class="outline-text-2" id="text-4">
</div></section>
<section id="slide-sec-4-1">
<h3 id="sec-4-1">Terminal Emulation (of sorts)</h3>
<ul>
<li class="fragment roll-in">irb - terminal formatting</li>
<li class="fragment roll-in">opal-irb, via a jqconsole fork, supports some ANSI formatting code</li>

</ul>

<span class="fragment (roll-in roll-in roll-in roll-in roll-in roll-in)"><p>
Example
</p></span>
<div class="org-src-container">

<pre  class="fragment (roll-in roll-in roll-in roll-in roll-in roll-in)"><span style="color: #DCDCCC; font-weight: bold;">puts</span> <span style="color: #CC9393;">"\033[31mRed Text"</span>
</pre>
</div>

</section>
<section id="slide-sec-4-1-1">
<h4 id="sec-4-1-1">ANSI colors In browser</h4>
<iframe width="100%" height="500" src="http://git.io/vmQVY" frameborder="0" allowfullscreen></iframe>

</section>
<section id="slide-sec-4-2">
<h3 id="sec-4-2">History up down history</h3>
<ul>
<li class="fragment roll-in">Like irb, opal-irb stores a history of previous statements.</li>
<li class="fragment roll-in">Navigate this history with the up/down arrows</li>
<li class="fragment roll-in">or use the "GNU readline commands".</li>

</ul>

</section>
<section id="slide-sec-4-2-1">
<h4 id="sec-4-2-1">GNU readline commands (emacs subset)</h4>
<ul>
<li class="fragment roll-in">A subset of the gnu readline manipulation is supported.</li>
<li class="fragment roll-in">Will likely add more support over time.</li>
<li class="fragment roll-in">The currently supported bindings are:</li>

</ul>

<pre  class="fragment (roll-in roll-in roll-in roll-in roll-in roll-in)">
Up/Down Arrow and ctrl-p/ctrl-n: Navigate through history
ctrl-a:                          Beginning of line
ctrl-e:                          End of line
ctrl-b:                          Back 1 character
ctrl-f:                          Forward 1 character
ctrl-d:                          Delete 1 character
ctrl-k:                          Kill to the end of the line
alt-b:                           Back 1 word
alt-f:                           Forward 1 word
alt-d:                           Delete 1 word
</pre>

</section>
<section id="slide-sec-4-3">
<h3 id="sec-4-3">Autocomplete</h3>
<ul>
<li class="fragment roll-in">A work-in-progress</li>
<li class="fragment roll-in">Same tab completion model that irb does.  It looks like this:</li>

</ul>

<pre  class="fragment (roll-in roll-in roll-in roll-in roll-in roll-in)">
opal&gt; S&lt;tab&gt;
STDERR          STDIN           STDOUT          ScriptError     Set
SignalException StandardError   StopIteration   String          StringIO
StringScanner   Struct          Symbol          SyntaxError     SystemCallError
SystemExit
</pre>

<pre  class="fragment (roll-in roll-in roll-in roll-in roll-in roll-in)">
opal&gt; ST&lt;tab&gt;
STDERR STDIN  STDOUT
</pre>

<pre  class="fragment (roll-in roll-in roll-in roll-in roll-in roll-in)">
opal&gt; STDI&lt;tab&gt;
</pre>

<pre  class="fragment (roll-in roll-in roll-in roll-in roll-in roll-in)">
opal&gt; STDIN
</pre>

</section>
<section id="slide-sec-4-4">
<h3 id="sec-4-4">Live Autocomplete demo</h3>
<iframe width="100%" height="500" src="http://fkchang.github.io/opal-irb/index-jq.html" frameborder="0" allowfullscreen></iframe>


</section>
<section id="slide-sec-4-5">
<h3 id="sec-4-5">Multi Line Input</h3>
<ul>
<li class="fragment roll-in">You can type multiple lines until your entry is complete.</li>
<li class="fragment roll-in">Incomplete lines shown with leading periods:</li>

</ul>

<pre  class="fragment (roll-in roll-in roll-in roll-in roll-in roll-in)">
Welcome to Opal 0.7.1
type help for assistance
opal&gt; class Foo
...   def bar
...     :bar
...     end
...     end
 =&gt; "bar"
opal&gt;
</pre>


</section>
</section>
<section>
<section id="slide-sec-5">
<h2 id="sec-5">2) Different than irb</h2>
<div class="outline-text-2" id="text-5">
</div></section>
<section id="slide-sec-5-1">
<h3 id="sec-5-1">Last value returned - irb</h3>
<p>
In irb the last value returned is stored in _ variable:
</p>

<pre  class="example">
2.2.1 :001 &gt; 2 * 3
 =&gt; 6
2.2.1 :002 &gt; puts _
6
 =&gt; nil
2.2.1 :003 &gt;
</pre>

</section>
<section id="slide-sec-5-2">
<h3 id="sec-5-2">Opal-irb</h3>
<ul>
<li class="fragment roll-in">Last value is stored as $_.</li>
<li class="fragment roll-in">Departs due to technical reasons</li>
<li class="fragment roll-in">Would like to make it the same</li>

</ul>

<pre  class="fragment (roll-in roll-in roll-in roll-in roll-in roll-in)">
opal&gt; 2 * 3
 =&gt; 6
opal&gt; puts $_
6
 =&gt; nil
opal&gt;
</pre>

</section>
<section id="slide-sec-5-3">
<h3 id="sec-5-3">Help command</h3>
<div class="outline-text-3" id="text-5-3">
</div></section>
<section id="slide-sec-5-3-1">
<h4 id="sec-5-3-1">irb</h4>
<p>
Help in irb allows you to lookup documentation for methods via ri and rdoc docs.
</p>

<pre  class="example">
2.0.0-p247 :001 &gt; help

Enter the method name you want to look up.
You can use tab to autocomplete.
Enter a blank line to exit.

&gt;&gt;
</pre>

</section>
<section id="slide-sec-5-3-2">
<h4 id="sec-5-3-2">Opal-irb</h4>
<ul>
<li class="fragment roll-in">Opal-irb's help shows how to operate opal-irb.</li>
<li class="fragment roll-in">Help for method lookup to be done in a different fashion.</li>

</ul>

</section>
<section id="slide-sec-5-3-3">
<h4 id="sec-5-3-3">Current help command output</h4>
<pre  class="example">
opal&gt; help
help:                            This text
$_                               last value returned is stored in this global
history:                         Shows history
irb_link_for history_num:        Create a link for the code in the history
ctrl-c:                          Abort prompt
ctrl-m:                          Pop up multi-line editor
ctrl-Enter:                      Submit code in multi-line editor
ctrl-l:                          Creates a link with the code you have on the current line/lines

EDITOR FUNCTIONALITY
Up/Down Arrow and ctrl-p/ctrl-n: Navigate through history
ctrl-a:                          Beginning of line
ctrl-e:                          End of line
ctrl-b:                          Back 1 character
ctrl-f:                          Forward 1 character
ctrl-d:                          Delete 1 character
ctrl-k:                          Kill to the end of the line
alt-b:                           Back 1 word
alt-f:                           Forward 1 word
alt-d:                           Delete 1 word
 =&gt; nil
</pre>

</section>
</section>
<section>
<section id="slide-sec-6">
<h2 id="sec-6">3) Beyond irb</h2>
<p>
There are number of things that opal-irb does that irb does not:
</p>


</section>
<section id="slide-sec-6-1">
<h3 id="sec-6-1">"Live gist", create a link w/code</h3>
<ul>
<li class="fragment roll-in">Create a link with  <code>ctl-l</code> (<code>l</code> for <code>link</code>),</li>
<li class="fragment roll-in">Link will be displayed above the line in question.</li>
<li class="fragment roll-in">Scroll through history, hit <code>ctl-l</code> to give history for that line</li>

</ul>

</section>
