doc/presentations/opal_irb_overview.org
*** Live gist
#+ATTR_REVEAL: :frag (roll-in roll-in roll-in roll-in roll-in roll-in)
- Like a gist, it's shareable bit of code.
- Unlike a gist, it's "live code"
- Live gist can be shared in any real app that has opal-irb embedded.
- Already used this in a production codebase to duplicate a bug condition for a coworker to debug.
- All embedded opal-irb's on this prensentation are all done via "live gist."
#+ATTR_REVEAL: :frag (roll-in roll-in roll-in roll-in roll-in roll-in)
  - For example, the red text printing example eariler

** Enhanced History
*** History Command (like shells have, bash, etc.)
#+ATTR_REVEAL: :frag (roll-in roll-in roll-in roll-in roll-in roll-in)
- You can type =history= at the prompt to get a listing of your history.
- Shows listing of the code you've typed in including line numbers.

#+ATTR_REVEAL: :frag (roll-in roll-in roll-in roll-in roll-in roll-in)
#+BEGIN_SRC
opal> history
1: class Foo
  def bar
    :bar
  end
end
2: f = Foo.new
3: f.bar
4: history
 => nil
opal>
#+END_SRC

*** Link for History
#+ATTR_REVEAL: :frag (roll-in roll-in roll-in roll-in roll-in roll-in)
- Alternate to navigating through history and typing =ctrl-l=
- Use =irb_link_for= command with the history number
- Different from =jsbin=, =jsfiddle=, etc.
#+ATTR_REVEAL: :frag (roll-in roll-in roll-in roll-in roll-in roll-in)
  - Experiment and have several  "live gists"
  - Matches repl-based experimentation.

#+ATTR_REVEAL: :frag (roll-in roll-in roll-in roll-in roll-in roll-in)
#+BEGIN_SRC
irb_link_for <history_num>
#+END_SRC


** Multiline edit
#+ATTR_REVEAL: :frag (roll-in roll-in roll-in roll-in roll-in roll-in roll-in roll-in roll-in roll-in)
- irb's multi-line edit can be cumbersome if you make a mistake
- I've made many
- Need to =ctrl-c= and start over
- opal-irb has multi-line editor support.
- Invoke with =ctrl-m= (m for the multi-line editor)
#+ATTR_REVEAL: :frag (roll-in roll-in roll-in roll-in roll-in roll-in)
  - Pops up editor window will pop up with the code on the prompt.
  - Has syntax highlighting
  - Auto indenting
  - WIP autocomplete functionality

*** More tips
#+ATTR_REVEAL: :frag (roll-in roll-in roll-in roll-in roll-in roll-in)
- Editor can be used with all code in the history
- Navigate to the desired code in your history and hit =ctl-m=.
- Run the code by hitting the  run it button, or the =ctrl-Enter= short cut.
- Close the window with either the close icon, or hit escape.

*** Live demo of Multiline edit
#+BEGIN_HTML
<iframe width="100%" height="500" src="http://fkchang.github.io/opal-irb/index-jq.html" frameborder="0" allowfullscreen></iframe>
#+END_HTML


** Requiring code at run time
#+ATTR_REVEAL: :frag (roll-in roll-in roll-in roll-in roll-in roll-in)
- *opal-irb* intended  to be able to explore things at run-time
- 2 commands to support this


*** require_remote
#+ATTR_REVEAL: :frag (roll-in roll-in roll-in roll-in roll-in roll-in)
- Part of *opal-parser*
- =require_remote= allows you require a remote ruby file.

#+ATTR_REVEAL: :frag (roll-in roll-in roll-in roll-in roll-in roll-in)
#+BEGIN_SRC ruby
require_remote <url_to_ruby_file>"
#+END_SRC

#+ATTR_REVEAL: :frag (roll-in roll-in roll-in roll-in roll-in roll-in)
As an example, I'll require the raw form of this gist, which prints
out "require_remote is cool" 10 times.

#+ATTR_REVEAL: :frag (roll-in roll-in roll-in roll-in roll-in roll-in)
#+BEGIN_HTML
<script src="https://gist.github.com/fkchang/c52173c276976a9ccede.js"></script>
#+END_HTML

*** require_remote In browser
#+BEGIN_HTML
<iframe width="100%" height="500" src="http://git.io/vOmoR" frameborder="0" allowfullscreen></iframe>
#+END_HTML

*** require_js (asynchronous require)

#+ATTR_REVEAL: :frag (roll-in roll-in roll-in roll-in roll-in roll-in)
- require_js requires javascript with a URL.
- Asynchronous
#+ATTR_REVEAL: :frag (roll-in roll-in roll-in roll-in roll-in roll-in)
   - Ok when typed in by hand, is usually fine, the file
   - If not hand typed, say via live-gist, you'll need to put some sort of delay.

*** A Raphael.js based example.
#+ATTR_REVEAL: :frag (roll-in roll-in roll-in roll-in roll-in roll-in)
- does a =require_js= of the raphael.js lib
- Adds a reanimate button (via Opal-browser's DOM DSL)
- delays via a =Timeout= and creates an animation and bind reanimation
  code to the reanimate button

*** require_js Raphael.js example
#+BEGIN_HTML
<iframe width="100%" height="500" src="http://git.io/vOm1c" frameborder="0" allowfullscreen></iframe>
#+END_HTML


*** require_js_sync (synchronous require)
#+ATTR_REVEAL: :frag (roll-in roll-in roll-in roll-in roll-in roll-in)
- Synchronous calls are atypical in javascript
- Chrome says this is deprecated
- Still might be useful

#+ATTR_REVEAL: :frag (roll-in roll-in roll-in roll-in roll-in roll-in)
Same raphael example, but without the delay

*** require_js_sync Raphael.js
#+BEGIN_HTML
<iframe width="100%" height="500" src="http://git.io/vOmDg" frameborder="0" allowfullscreen></iframe>
#+END_HTML

** Say, say, say, what you want...
#+ATTR_REVEAL: :frag (roll-in roll-in roll-in roll-in roll-in roll-in)
- I use the =say= command in OSX a lot
- Lets me know when a long running process is done
- Implemented for opal-irb, may make a standalone gem

*** say example in the browser
#+BEGIN_HTML
<iframe width="100%" height="500" src="http://git.io/vYveZ" frameborder="0" allowfullscreen></iframe>
#+END_HTML


* Examples
#+ATTR_REVEAL: :frag (roll-in roll-in roll-in roll-in roll-in roll-in)
- There are several example opal-irb pages referenced from the README on https://github.com/fkchang/opal-irb. They are:

** Homebrew console example
#+ATTR_REVEAL: :frag (roll-in roll-in roll-in roll-in roll-in roll-in)
#+ATTR_HTML: :target "_blank"
- My 1st attempt, port of a [[https://github.com/larryng/coffeescript-repl][coffescript repl]] with hand written terminal code
- not as full features as the jq-console example

** Homebrew console live
#+ATTR_HTML: :target "_blank"
http://fkchang.github.io/opal-irb/index-homebrew.html

#+BEGIN_HTML
<iframe width="100%" height="500" src="http://fkchang.github.io/opal-irb/index-homebrew.html" frameborder="0" allowfullscreen></iframe>
#+END_HTML

** jq-console Example
#+ATTR_REVEAL: :frag (roll-in roll-in roll-in roll-in roll-in roll-in)
- This uses (a fork of) =jq-console=, for improved console support.
- Most development has been on a =jq-console= based *opal-irb*
- I might revisit a =jq-console= port  to remove the *jquery* dependency in *opal-irb*

** jq-console Live
#+ATTR_HTML: :target "_blank"
http://fkchang.github.io/opal-irb/index-jq.html
#+BEGIN_HTML
<iframe width="100%" height="500" src="http://fkchang.github.io/opal-irb/index-jq.html" frameborder="0" allowfullscreen></iframe>
#+END_HTML


