doc/presentations/opal_irb_overview.html
<section id="slide-sec-6-1-1">
<h4 id="sec-6-1-1">Live gist</h4>
<ul>
<li class="fragment roll-in">Like a gist, it's shareable bit of code.</li>
<li class="fragment roll-in">Unlike a gist, it's "live code"</li>
<li class="fragment roll-in">Live gist can be shared in any real app that has opal-irb embedded.</li>
<li class="fragment roll-in">Already used this in a production codebase to duplicate a bug condition for a coworker to debug.</li>
<li class="fragment roll-in">All embedded opal-irb's on this prensentation are all done via "live gist."</li>

</ul>
<ul>
<li class="fragment roll-in">For example, the red text printing example eariler</li>

</ul>

</section>
<section id="slide-sec-6-2">
<h3 id="sec-6-2">Enhanced History</h3>
<div class="outline-text-3" id="text-6-2">
</div></section>
<section id="slide-sec-6-2-1">
<h4 id="sec-6-2-1">History Command (like shells have, bash, etc.)</h4>
<ul>
<li class="fragment roll-in">You can type <code>history</code> at the prompt to get a listing of your history.</li>
<li class="fragment roll-in">Shows listing of the code you've typed in including line numbers.</li>

</ul>

<pre  class="fragment (roll-in roll-in roll-in roll-in roll-in roll-in)">
opal&gt; history
1: class Foo
  def bar
    :bar
  end
end
2: f = Foo.new
3: f.bar
4: history
 =&gt; nil
opal&gt;
</pre>

</section>
<section id="slide-sec-6-2-2">
<h4 id="sec-6-2-2">Link for History</h4>
<ul>
<li class="fragment roll-in">Alternate to navigating through history and typing <code>ctrl-l</code></li>
<li class="fragment roll-in">Use <code>irb_link_for</code> command with the history number</li>
<li class="fragment roll-in">Different from <code>jsbin</code>, <code>jsfiddle</code>, etc.</li>

</ul>
<ul>
<li class="fragment roll-in">Experiment and have several  "live gists"</li>
<li class="fragment roll-in">Matches repl-based experimentation.</li>

</ul>

<pre  class="fragment (roll-in roll-in roll-in roll-in roll-in roll-in)">
irb_link_for &lt;history_num&gt;
</pre>


</section>
<section id="slide-sec-6-3">
<h3 id="sec-6-3">Multiline edit</h3>
<ul>
<li class="fragment roll-in">irb's multi-line edit can be cumbersome if you make a mistake</li>
<li class="fragment roll-in">I've made many</li>
<li class="fragment roll-in">Need to <code>ctrl-c</code> and start over</li>
<li class="fragment roll-in">opal-irb has multi-line editor support.</li>
<li class="fragment roll-in">Invoke with <code>ctrl-m</code> (m for the multi-line editor)</li>

</ul>
<ul>
<li class="fragment roll-in">Pops up editor window will pop up with the code on the prompt.</li>
<li class="fragment roll-in">Has syntax highlighting</li>
<li class="fragment roll-in">Auto indenting</li>
<li class="fragment roll-in">WIP autocomplete functionality</li>

</ul>

</section>
<section id="slide-sec-6-3-1">
<h4 id="sec-6-3-1">More tips</h4>
<ul>
<li class="fragment roll-in">Editor can be used with all code in the history</li>
<li class="fragment roll-in">Navigate to the desired code in your history and hit <code>ctl-m</code>.</li>
<li class="fragment roll-in">Run the code by hitting the  run it button, or the <code>ctrl-Enter</code> short cut.</li>
<li class="fragment roll-in">Close the window with either the close icon, or hit escape.</li>

</ul>

</section>
<section id="slide-sec-6-3-2">
<h4 id="sec-6-3-2">Live demo of Multiline edit</h4>
<iframe width="100%" height="500" src="http://fkchang.github.io/opal-irb/index-jq.html" frameborder="0" allowfullscreen></iframe>


</section>
<section id="slide-sec-6-4">
<h3 id="sec-6-4">Requiring code at run time</h3>
<ul>
<li class="fragment roll-in"><b>opal-irb</b> intended  to be able to explore things at run-time</li>
<li class="fragment roll-in">2 commands to support this</li>

</ul>


</section>
<section id="slide-sec-6-4-1">
<h4 id="sec-6-4-1">require_remote</h4>
<ul>
<li class="fragment roll-in">Part of <b>opal-parser</b></li>
<li class="fragment roll-in"><code>require_remote</code> allows you require a remote ruby file.</li>

</ul>

<div class="org-src-container">

<pre  class="fragment (roll-in roll-in roll-in roll-in roll-in roll-in)">require_remote &lt;url_to_ruby_file&gt;<span style="color: #CC9393;">"</span>
</pre>
</div>

<span class="fragment (roll-in roll-in roll-in roll-in roll-in roll-in)"><p>
As an example, I'll require the raw form of this gist, which prints
out "require_remote is cool" 10 times.
</p></span>

<script src="https://gist.github.com/fkchang/c52173c276976a9ccede.js"></script>

</section>
<section id="slide-sec-6-4-2">
<h4 id="sec-6-4-2">require_remote In browser</h4>
<iframe width="100%" height="500" src="http://git.io/vOmoR" frameborder="0" allowfullscreen></iframe>

</section>
<section id="slide-sec-6-4-3">
<h4 id="sec-6-4-3">require_js (asynchronous require)</h4>
<ul>
<li class="fragment roll-in">require_js requires javascript with a URL.</li>
<li class="fragment roll-in">Asynchronous</li>

</ul>
<ul>
<li class="fragment roll-in">Ok when typed in by hand, is usually fine, the file</li>
<li class="fragment roll-in">If not hand typed, say via live-gist, you'll need to put some sort of delay.</li>

</ul>

</section>
<section id="slide-sec-6-4-4">
<h4 id="sec-6-4-4">A Raphael.js based example.</h4>
<ul>
<li class="fragment roll-in">does a <code>require_js</code> of the raphael.js lib</li>
<li class="fragment roll-in">Adds a reanimate button (via Opal-browser's DOM DSL)</li>
<li class="fragment roll-in">delays via a <code>Timeout</code> and creates an animation and bind reanimation
code to the reanimate button</li>

</ul>

</section>
<section id="slide-sec-6-4-5">
<h4 id="sec-6-4-5">require_js Raphael.js example</h4>
<iframe width="100%" height="500" src="http://git.io/vOm1c" frameborder="0" allowfullscreen></iframe>


</section>
<section id="slide-sec-6-4-6">
<h4 id="sec-6-4-6">require_js_sync (synchronous require)</h4>
<ul>
<li class="fragment roll-in">Synchronous calls are atypical in javascript</li>
<li class="fragment roll-in">Chrome says this is deprecated</li>
<li class="fragment roll-in">Still might be useful</li>

</ul>

<span class="fragment (roll-in roll-in roll-in roll-in roll-in roll-in)"><p>
Same raphael example, but without the delay
</p></span>

</section>
<section id="slide-sec-6-4-7">
<h4 id="sec-6-4-7">require_js_sync Raphael.js</h4>
<iframe width="100%" height="500" src="http://git.io/vOmDg" frameborder="0" allowfullscreen></iframe>

</section>
<section id="slide-sec-6-5">
<h3 id="sec-6-5">Say, say, say, what you want&#x2026;</h3>
<ul>
<li class="fragment roll-in">I use the <code>say</code> command in OSX a lot</li>
<li class="fragment roll-in">Lets me know when a long running process is done</li>
<li class="fragment roll-in">Implemented for opal-irb, may make a standalone gem</li>

</ul>

</section>
<section id="slide-sec-6-5-1">
<h4 id="sec-6-5-1">say example in the browser</h4>
<iframe width="100%" height="500" src="http://git.io/vYveZ" frameborder="0" allowfullscreen></iframe>


</section>
</section>
<section>
<section id="slide-sec-7">
<h2 id="sec-7">Examples</h2>
<ul>
<li class="fragment roll-in">There are several example opal-irb pages referenced from the README on <a href="https://github.com/fkchang/opal-irb">https://github.com/fkchang/opal-irb</a>. They are:</li>

</ul>

</section>
<section id="slide-sec-7-1">
<h3 id="sec-7-1">Homebrew console example</h3>
<ul target="&quot;_blank&quot;">
<li class="fragment roll-in">My 1st attempt, port of a <a href="https://github.com/larryng/coffeescript-repl">coffescript repl</a> with hand written terminal code</li>
<li class="fragment roll-in">not as full features as the jq-console example</li>

</ul>

</section>
<section id="slide-sec-7-2">
<h3 id="sec-7-2">Homebrew console live</h3>
<p>
<a href="http://fkchang.github.io/opal-irb/index-homebrew.html" target="&quot;_blank&quot;">http://fkchang.github.io/opal-irb/index-homebrew.html</a>
</p>

<iframe width="100%" height="500" src="http://fkchang.github.io/opal-irb/index-homebrew.html" frameborder="0" allowfullscreen></iframe>

</section>
<section id="slide-sec-7-3">
<h3 id="sec-7-3">jq-console Example</h3>
<ul>
<li class="fragment roll-in">This uses (a fork of) <code>jq-console</code>, for improved console support.</li>
<li class="fragment roll-in">Most development has been on a <code>jq-console</code> based <b>opal-irb</b></li>
<li class="fragment roll-in">I might revisit a <code>jq-console</code> port  to remove the <b>jquery</b> dependency in <b>opal-irb</b></li>

</ul>

</section>
